"""
Розробіть множину unittest тестів для функції line_intersect,
яка призначена для пошуку точки перетину двох прямих.
 Прямі задані парою точок, через які вони проходять,
  наприклад [(0.0, 0.0), (1.0, 3.0)].
  Аргументами при виклику функції є дві прямі задані координатами цих точок.
  Набір тестів повинен містити мінімум шість тестових випадків та враховувати
  наступні особливості:

a.       Якщо прямі не перетинаються то функція line_intersect повертає None.

b.       Якщо прямі перетинаються то функція line_intersect
повертає точку перетину, наприклад (0.5, 0.75).

c.       Якщо прямі співпадать то функція повинна повертати перший аргумент.


При розробці тестів зверніть увагу (перечитайте help)
по використанню методів setUp та tearDown класу TestCase.
"""


import unittest


class LineIntersectTestCase(unittest.TestCase):
    def setUp(self):
        self.widget = Widget('The widget')

    def tearDown(self):
        self.widget.dispose()
